{
    "certificates": [
        {
            "title": "AWS Cloud Quest: Cloud Practitioner",
            "description": "Demonstrates foundational knowledge of AWS services and hands-on experience with compute, networking, databases, and security.",
            "image": "../images/certificates/aws-cloud.webp"
        },
        {
            "title": "NDG Linux Essentials",
            "description": "Completed the NDG Linux Essentials course, showcasing foundational knowledge of the Linux operating system, command-line navigation, security, file permissions, and system management.",
            "image": "../images/certificates/Linux Essent-certificate.webp"
        },
        {
            "title": "Python Programming Certificate",
            "description": "Completed a comprehensive course covering Python from basics to advanced topics, including data structures, OOP, database operations, Flask, Numpy, Pandas, and Matplotlib.",
            "image": "../images/certificates/Python.webp"
        },
        {
            "title": "CISCO Networking Devices and Initial Configuration",
            "description": "Completed a networking course covering essential network device configuration, IP addressing, and foundational concepts in cloud and virtualization",
            "image": "../images/certificates/NetworkingDevices.webp"
        },
        {
            "title": "Unity Game Development",
            "description": "Completed a course on Unity game development, covering the basics of the engine and creating a 2D game to apply and solidify foundational skills.",
            "image": "../images/certificates/Unity.webp"
        },
        {
            "title": "AWS Cloud Practitioner-Discovery Day",
            "description": "Attended a training event covering the benefits of AWS Cloud computing and key services for compute, storage, databases, networking, and content delivery.",
            "image": "../images/certificates/aws-cloud-practitioner.webp"
        },
        {
            "title": "Lightroom Photo Editing",
            "description": "Completed a course on Adobe Lightroom, focusing on photo editing techniques and tools to enhance photography.",
            "image": "../images/certificates/lightroom.webp"
        },
        {
            "title": "Magara Jam Attandance Bagde",
            "description": "Participated in a 48-hour game jam, creating a game from scratch based on a theme and constraints.",
            "image": "../images/certificates/magaraJam.webp"
        },
        {
            "title": "Artifical Intelligence Summer School",
            "description": "Participated in a Artifical Intelligence event  organized by the Yalova University.",
            "image": "../images/certificates/yazsum.webp"
        }
    ]
}